Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་ཕྱི་ནང་སྟོང་པ་ཉིད་དངོས་པོ་མེད་ལ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་།
en: However, Subhūti, the emptiness of external and internal phenomena is a nonentity, and because it is not an entity, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ། དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་།
en: Subhūti, if [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, were entities and not nonentities, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དངོས་པོ་མེད་ལ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཏེ་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི།
en: However, Subhūti, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are nonentities, and because they are not entities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དངོས་པོ་མེད་ལ།
en: Subhūti, if the applications of mindfulness were entities and not nonentities, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: However, Subhūti, the applications of mindfulness are nonentities, and because they are not entities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་།
en: Subhūti, if the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path were entities and not nonentities, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དངོས་པོ་མེད་ལ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ།
en: However, Subhūti, the noble eightfold path [and the other causal attributes] are nonentities, and because they are not entities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: །རབ་འབྱོར་གལ་ཏེ་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོ
en: Subhūti, if the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways were entities and not nonentities, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: མས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་གཟུངས་ཀྱི་སྒོ་རྣམས་དངོས་པོ་མེད་ལ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་།
en: However, Subhūti, the dhāraṇī gateways [and so forth] are nonentities, and because they are not entities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་
en: Subhūti, if the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great compassion, and the eighteen distinct qualities of the buddhas were entities and not nonentities, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: མ་ཡིན་ན་ནི། ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དངོས་པོ་མེད་ལ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ།
en: However, Subhūti, the eighteen distinct qualities of the buddhas [and the other fruitional attributes] are nonentities, and because they are not entities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: །རབ་འབྱོར་གལ་ཏེ་རིགས་ཀྱི་སའི་ཆོས་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ།
en: Subhūti, if the attributes of the level of the spiritual family were entities and not nonentities, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: རབ་འབྱོར་རིགས་ཀྱི་སའི་ཆོས་དངོས་པོ་མེད་ལ་དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་བརྒྱད་པའི་སའི་ཆོས་དང་། རྒྱུན་དུ་ཞུགས་པའི་ཆོས་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་ཆོས་དང་། ཕྱིར་མི་འོང་བའི་ཆོས་དང་། དགྲ་བཅོམ་པའི་ཆོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི།
en: However, Subhūti, the attributes of the level of the spiritual family are nonentities, and because they are not entities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་སངས་རྒྱས་ཀྱི་ཆོས་དངོས་པོ་མེད་ལ།
en: Subhūti, if the attributes of the eighth-lowest level, the attributes of those who enter the stream to nirvāṇa, the attributes of those who are destined for only one more rebirth, the attributes of those who are no longer subject to rebirth, the attributes of arhats, the attributes of pratyekabuddhas, the attributes of bodhisattvas, and the attributes of the buddhas were entities and not nonentities, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: དངོས་པོ་ཡོད་པ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་རིགས་ཀྱིས་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི།
en: However, Subhūti, the attributes of the buddhas [and so forth] are nonentities, and because they are not entities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་རིགས་ཀྱིས་དངོས་པོ་མེད་ལ།
en: Subhūti, if those who have attained the level of the spiritual family were entities and not nonentities, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་བརྒྱད་པ་དང་། རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་།
en: However, Subhūti, those who have attained the level of the spiritual family are nonentities, and because they are not entities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི་ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ།
en: Subhūti, if those who have attained the eighth-lowest level, and those who have entered the stream to nirvāṇa, those who are destined for only one more rebirth, those who are no longer subject to rebirth, those who are arhats, pratyekabuddhas, and bodhisattvas, and those who are tathāgatas, arhats, completely awakened buddhas were entities and not nonentities, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དངོས་པོ་མེད་ལ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་ཆོས་ཀྱི་དབྱིངས་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི།
en: However, Subhūti, the tathāgatas, arhats, completely awakened buddhas [and so forth] are nonentities, and because they are not entities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་དངོས་པོ་མེད་ལ།
en: Subhūti, if the realm of phenomena were an entity and not a nonentity, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི།
en: However, Subhūti, the realm of phenomena is a nonentity, and because it is not an entity, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དངོས་པོ་མེད་ལ།
en: Subhūti, if the real nature, the very limit of reality, and the inconceivable realm were entities and not nonentities, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ།
en: However, Subhūti, the inconceivable realm [and so forth] are nonentities, and because they are not entities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: །རབ་འབྱོར་གལ་ཏེ་ལྷ་དང་། མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ།
en: Subhūti, if the world with its gods, humans, and asuras were an entity and not a nonentity, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: རབ་འབྱོར་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་དངོས་པོ་མེད་ལ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ།
en: However, Subhūti, the world with its gods, humans, and asuras is a nonentity, and because it is not an entity, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: །རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་དང་པོ་བསྐྱེད་ཕྱིན་ཆད་སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ། སེམས་བསྐྱེད་པ་ཇི་སྙེད་ཅིག་བྱུང་བ་དེ་དག་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། སེམས་དང་པོ་བསྐྱེད་ཕྱིན་ཅད་སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ།
en: Subhūti, if all [altruistic] thoughts cultivated by bodhisattva great beings from the time when they first begin to set their minds on enlightenment, up to the time when they are seated at the site of enlightenment, as many as there are, were entities and not nonentities, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: སེམས་བསྐྱེད་པ་ཇི་སྙེད་ཅིག་བྱུང་བ་དེ་དག་དངོས་པོ་མེད་ལ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ།
en: However, Subhūti, all [altruistic] thoughts cultivated by bodhisattva great beings from the time when they first begin to set their minds on enlightenment, up to the time when they are seated at site of enlightenment, as many as there are, are nonentities, and because they are not entities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: །རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི། ཡེ་ཤེས་རྡོ་རྗེ་ལྟ་བུ་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ།
en: Subhūti, if the vajra-like wisdom of bodhisattva great beings were an entity and not a nonentity, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡེ་ཤེས་རྡོ་རྗེ་ལྟ་བུ་དངོས་པོ་མེད་ལ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ།
en: However, Subhūti, the vajra-like wisdom of bodhisattva great beings is a nonentity, and because it is not an entity, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: །རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡེ་ཤེས་རྡོ་རྗེ་ལྟ་བུ་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་དངོས་པོ་མེད་པར་ཁོང་དུ་ཆུད་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་ཡང་མི་འགྱུར།
en: Subhūti, if the vajra-like wisdom of bodhisattva great beings were an entity and not a nonentity, {Dt.234} then indeed bodhisattva great beings, after realizing that all afflicted mental states associated with the [reincarnated] continuity of propensities are not entities, would not have to acquire all-aspect omniscience.

source: ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ།
en: They would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡེ་ཤེས་རྡོ་རྗེ་ལྟ་བུ་དངོས་པོ་མེད་ལ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་དངོས་པོ་མེད་པར་ཁོང་དུ་ཆུད་དེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་འཐོབ།
en: However, Subhūti, the vajra-like wisdom of bodhisattva great beings is a nonentity, and because it is not an entity, bodhisattva great beings, after realizing that all afflicted mental states associated with the [reincarnated] continuity of propensities are not entities, do indeed acquire all-aspect omniscience.

source: །ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བ་ཡིན་ནོ།
en: They do overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: །རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དངོས་པོ་མེད་པ་མ་ཡིན་ཏེ། དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ན་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཀྱང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་གཟི་བརྗིད་དང་། དཔལ་གྱིས་ལྷམ་མེར་མི་འགྱུར། ལྷན་ནེར་མི་འགྱུར། ལྷང་ངེར་མི་འགྱུར་ཏེ།
en: Subhūti, if the thirty-two major marks of a great person that the tathāgatas, arhats, completely awakened buddhas possess were entities and not nonentities, then indeed the tathāgatas, arhats, completely awakened buddhas would not overpower and outshine the world, with its gods, humans, and asuras, with their magnificence and glory.

source: རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དངོས་པོ་མེད་ལ་དངོས་པོ་མ་ཡིན་པས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཏེ། གཟི་བརྗིད་དང་། དཔལ་གྱིས། ལྷམ་མེ།
en: However, Subhūti, the thirty-two major marks of a great person that the tathāgatas, arhats, completely awakened buddhas possess are nonentities, and because they are not entities, the tathāgatas, arhats, completely awakened buddhas do overpower and outshine the world, with its gods, humans, and asuras, with their magnificence and glory. “

source: ལྷན་ནེ། ལྷང་ངེར་གྱུར་པ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་འོད་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བས་རྒྱས་པར་མི་མཛད་དེ།
en: Subhūti, if the luminosity of the tathāgatas, arhats, completely awakened buddhas, were an entity and not a nonentity, then the tathāgatas, arhats, completely awakened buddhas would not pervade worlds as numerous as the grains of sand of the river Gaṅgā with their luminosity.

source: རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་འོད་དངོས་པོ་མེད་དེ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་འོད་ཀྱིས་རྒྱས་པར་འགེངས་པ་མཛད་དོ།
en: However, Subhūti, the luminosity of the tathāgatas, arhats, completely awakened buddhas is a nonentity, and because it is not an entity, the tathāgatas, arhats, completely awakened buddhas do permeate worlds as numerous as the grains of sand of the river Gaṅgā with their luminosity. “

source: །རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་གསུང་ཡན་ལག་དྲུག་ཅུ་དང་ལྡན་པ་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གསུང་གིས་མངོན་པར་གོ་བར་ཡང་མི་མཛད་དེ། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་གསུང་ཡན་ལག་དྲུག་ཅུ་དང་ལྡན་པ་དངོས་པོ་མེད་ལ། དངོས་པོ་མ་ཡིན་པས།
en: Subhūti, if the voice of the tathāgatas, arhats, completely awakened buddhas, endowed with its sixty aspects, were an entity and not a nonentity, then the tathāgatas, arhats, completely awakened buddhas would not envelop the worlds of the ten directions, as numerous as the grains of sand of the river Gaṅgā, with their voice.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གསུང་གིས་མངོན་པར་གོ་བར་མཛད་དོ། །རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ།
en: However, Subhūti, the voice of the tathāgatas, arhats, completely awakened buddhas, endowed with its sixty aspects, is a nonentity, and because it is not an entity, the tathāgatas, arhats, completely awakened buddhas do envelop the worlds of the ten directions, as numerous as the grains of sand of the river Gaṅgā, with their voice. “

source: ལྷའམ། བདུད་དམ། ཚངས་པའམ་སུས་ཀྱང་རུང་སྟེ། འཇིག་རྟེན་དུ་ཆོས་དང་ལྡན་པར་བསྐོར་བར་མི་ནུས་པ་བསྐོར་བར་ཡང་མི་འགྱུར་ཏེ། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་དངོས་པོ་མེད་དེ་དངོས་པོ་མ་ཡིན་པས།
en: Subhūti, if the wheel of Dharma of the tathāgatas, arhats, completely awakened buddhas were an entity and not a nonentity, then the tathāgatas, arhats, completely awakened buddhas would not promulgate in the world that wheel of Dharma that could not previously have been turned in conformity with the Dharma by any virtuous ascetic, brahmin, god, demon, Brahmā, or anyone else.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཆོས་ཀྱི་འཁོར་ལོ་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ། ཚངས་པ་འམ།
en: However, Subhūti, the wheel of Dharma of the tathāgatas, arhats, completely awakened buddhas is a nonentity, and because it is not an entity, the tathāgatas, arhats, completely awakened buddhas do promulgate that wheel of Dharma that could not previously have been turned in conformity with the Dharma by any virtuous ascetic, brahmin, god, demon, Brahmā, or anyone else. “

source: སུས་ཀྱང་རུང་སྟེ། འཇིག་རྟེན་དུ་ཆོས་དང་ལྡན་པར་བསྐོར་བར་མི་ནུས་པ་རབ་ཏུ་བསྐོར་རོ། །རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་གང་གི་དོན་དུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་སེམས་ཅན་དེ་དག་དངོས་པོ་ཡོད་པ་ཞིག་ཡིན་ཏེ། དངོས་པོ་མེད་པ་མ་ཡིན་ན་ནི། སེམས་ཅན་དེ་དག་ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་འདའ་བར་ཡང་མི་འགྱུར་ཏེ།
en: Subhūti, if the beings for whom the tathāgatas, arhats, completely awakened buddhas turn the wheel of Dharma were entities and not nonentities, then [the tathāgatas] would not bring those beings to attain final nirvāṇa, in the expanse of nirvāṇa where no residue of the psycho-physical aggregates is left behind.

source: རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་གང་གི་དོན་དུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་སེམས་ཅན་དེ་དག་དངོས་པོ་མེད་དེ། དངོས་པོ་མ་ཡིན་པས། དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: However, Subhūti, the beings for whom the tathāgatas, arhats, completely awakened buddhas turn the wheel of Dharma are nonentities, and because they are not entities, [the tathāgatas] have indeed brought, are bringing, and will bring those beings to attain final nirvāṇa, in the expanse of nirvāṇa where no residue of the psycho-physical aggregates is left behind. “

source: །རབ་འབྱོར་གང་ཡང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ་ཐེག་པ་དེ་ནི་ནམ་མཁའ་དང་མཉམ་པའོ་ཞེས་སྨྲས་པ་ནི། དེ་དེ་བཞིན་ནོ།
en: Subhūti, you have said that this vehicle is the same as space.

source: །རབ་འབྱོར་དེ་དེ་བཞིན་ཏེ།
en: So it is, Subhūti!

source: ཐེག་པ་དེ་ནི་ནམ་མཁའ་དང་མཉམ་པའོ།
en: So it is! This vehicle is the same as space.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། ནམ་མཁའ་ལ་ནི་ཤར་ཕྱོགས་དམིགས་སུ་མེད་དོ།
en: As an analogy, Subhūti, in space the eastern direction is not apprehensible.
